Simplifiy README
